const syllables_1 = {
  "he": "ሀ", "hu": "ሁ", "hi": "ሂ", "ha": "ሃ", "hee": "ሄ", "h": "ህ", "ho": "ሆ",
  "Le": "ለ", "Lu": "ሉ", "Li": "ሊ", "La": "ላ", "Lee": "ሌ", "L": "ል", "Lo": "ሎ",
  "Ḥe": "ሐ", "Ḥu": "ሑ", "Ḥi": "ሒ", "Ḥa": "ሓ", "Ḥee": "ሔ", "Ḥ": "ሕ", "Ḥo": "ሖ",
  "Me": "መ", "Mu": "ሙ", "Mi": "ሚ", "Ma": "ማ", "Mee": "ሜ", "M": "ም", "Mo": "ሞ",
  "Śe": "ሠ", "Śu": "ሡ", "Śi": "ሢ", "Śa": "ሣ", "Śee": "ሤ", "Ś": "ሥ", "Śo": "ሦ",
  "Re": "ረ", "Ru": "ሩ", "Ri": "ሪ", "Ra": "ራ", "Ree": "ሬ", "R": "ር", "Ro": "ሮ",
  "Se": "ሰ", "Su": "ሱ", "Si": "ሲ", "Sa": "ሳ", "See": "ሴ", "S": "ስ", "So": "ሶ",
  "Še": "ሸ", "Šu": "ሹ", "Ši": "ሺ", "Ša": "ሻ", "Šee": "ሼ", "Š": "ሽ", "Šo": "ሾ",
  "Qe": "ቀ", "Qu": "ቁ", "Qi": "ቂ", "Qa": "ቃ", "Qee": "ቄ", "Q": "ቅ", "Qo": "ቆ",
  "Be": "በ", "Bu": "ቡ", "Bi": "ቢ", "Ba": "ባ", "Bee": "ቤ", "B": "ብ", "Bo": "ቦ",
  "te": "ተ", "tu": "ቱ", "ti": "ቲ", "ta": "ታ", "tee": "ቴ", "t": "ት", "to": "ቶ",
  "Che": "ቸ", "Chu": "ቹ", "Chi": "ቺ", "Cha": "ቻ", "Chee": "ቼ", "Ch": "ች", "Cho": "ቾ",
  "Ḫe": "ኀ", "Ḫu": "ኁ", "Ḫi": "ኂ", "Ḫa": "ኃ", "Ḫee": "ኄ", "Ḫ": "ኅ", "Ḫo": "ኆ",
  "Ne": "ነ", "Nu": "ኑ", "Ni": "ኒ", "Na": "ና", "Nee": "ኔ", "N": "ን", "No": "ኖ",
  "Ñe": "ኘ", "Ñu": "ኙ", "Ñi": "ኚ", "Ña": "ኛ", "Ñee": "ኜ", "Ñ": "ኝ", "Ño": "ኞ",
  "A": "ዓ", "U": "ዑ", "I": "ዒ", "E": "ዔ", "": "ዕ", "O": "ዖ", "Ke": "ከ",
  "Ku": "ኩ", "Ki": "ኪ", "Ka": "ካ", "Kee": "ኬ", "K": "ክ", "Ko": "ኮ", "Khe": "ኸ",
  "Khu": "ኹ", "Khi": "ኺ", "Kha": "ኻ", "Khee": "ኼ", "Kh": "ኽ", "Kho": "ኾ", "We": "ወ",
  "Wu": "ዉ", "Wi": "ዊ", "Wa": "ዋ", "Wee": "ዌ", "W": "ው", "Wo": "ዎ", "e": "ዐ",
  "Ze": "ዘ", "Zu": "ዙ", "Zi": "ዚ", "Za": "ዛ", "Zee": "ዜ", "Z": "ዝ", "Zo": "ዞ",
  "Že": "ዠ", "Žu": "ዡ", "Ži": "ዢ", "Ža": "ዣ", "Žee": "ዤ", "Ž": "ዥ", "Žo": "ዦ",
  "Ye": "የ", "Yu": "ዩ", "Yi": "ዪ", "Ya": "ያ", "Yee": "ዬ", "Y": "ይ", "Yo": "ዮ",
  "De": "ደ", "Du": "ዱ", "Di": "ዲ", "Da": "ዳ", "Dee": "ዴ", "D": "ድ", "Do": "ዶ",
  "Je": "ጀ", "Ju": "ጁ", "Ji": "ጂ", "Ja": "ጃ", "Jee": "ጄ", "J": "ጅ", "Jo": "ጆ",
  "Ge": "ገ", "Gu": "ጉ", "Gi": "ጊ", "Ga": "ጋ", "Gee": "ጌ", "G": "ግ", "Go": "ጎ",
  "Te": "ጠ", "Tu": "ጡ", "Ti": "ጢ", "Ta": "ጣ", "Tee": "ጤ", "T": "ጥ", "To": "ጦ",
  "Če": "ጨ", "Ču": "ጩ", "Či": "ጪ", "Ča": "ጫ", "Čee": "ጬ", "Č": "ጭ", "Čo": "ጮ",
  "Phe": "ጰ", "Phu": "ጱ", "Phi": "ጲ", "Pha": "ጳ", "Phee": "ጴ", "Ph": "ጵ", "Pho": "ጶ",
  "Tse": "ፀ", "Tsu": "ፁ", "Tsi": "ፂ", "Tsa": "ፃ", "Tsee": "ፄ", "Ts": "ፅ", "Tso": "ፆ",
  "Fe": "ፈ", "Fu": "ፉ", "Fi": "ፊ", "Fa": "ፋ", "Fee": "ፌ", "F": "ፍ", "Fo": "ፎ",
  "Pe": "ፐ", "Pu": "ፑ", "Pi": "ፒ", "Pa": "ፓ", "Pee": "ፔ", "P": "ፕ", "Po": "ፖ"
};

const syllables = {
  "he":"ሀ","hu":"ሁ","hi":"ሂ","ha":"ሃ","hee":"ሄ","h":"ህ","ho":"ሆ",
  "le":"ለ","lu":"ሉ","li":"ሊ","la":"ላ","Lee": "ሌ","l":"ል","lo":"ሎ",
  
  "me":"መ","mu":"ሙ","mi":"ሚ","ma":"ማ","Mee":"ሜ","m":"ም","mo":"ሞ",
  "sze": "ሠ", "szu": "ሡ", "szi": "ሢ", "sza": "ሣ", "szee": "ሤ", "sz": "ሥ", "szo": "ሦ",
  "re":"ረ","ru":"ሩ","ri":"ሪ","ra":"ራ","Ree": "ሬ","r":"ር","ro":"ሮ",
  "se":"ሰ","su":"ሱ","si":"ሲ","sa":"ሳ","see": "ሴ","s":"ስ","so":"ሶ",
  "ne":"ነ","nu":"ኑ","ni":"ኒ","na":"ና","n":"ን","no":"ኖ",
  "te":"ተ","tu":"ቱ","ti":"ቲ","ta":"ታ","t":"ት","to":"ቶ",
  "ye":"የ","yu":"ዩ","yi":"ይ","ya":"ያ","y":"ይ","yo":"ዮ",
  "e":"እ","i":"ኢ","a":"አ","u":"ኡ","o":"ኦ"
};

function transliterate(input) {
  let out = "";
  let i = 0;

  while (i < input.length) {
    let match = "";

    for (let len = 4; len > 0; len--) {
      let part = input.substr(i, len); //.toLowerCase();
      if (syllables[part]) {
        match = syllables[part];
        i += len;
        break;
      }
    }

    if (match) {
      out += match;
    } else {
      out += input[i];
      i++;
    }
  }

  return out;
}
